{"pageProps":{"data":[{"_id":"63699208844f8efad0e6ee40","name":"Jeff Bezos","gender":"Male","email":"Jeff@amezon.com","category":"CEO","url":"http://res.cloudinary.com/ddms76vie/image/upload/v1667863049/yawh2vjlwto0autoug4h.jpg","about":"After Bezos graduated from college in 1986, he was offered jobs at Intel, Bell Labs, and Andersen Consulting, among others.[43] He first worked at Fitel, a fintech telecommunications start-up, where he was tasked with building a network for international trade.[44] Bezos was promoted to head of development and director of customer service thereafter. He transitioned into the banking industry when he became a product manager at Bankers Trust from 1988 to 1990. He then joined D. E. Shaw & Co, a newly founded hedge fund with a strong emphasis on mathematical modelling in 1990 and worked there until 1994. Bezos became D. E. Shaw's fourth senior vice-president at age 30.","__v":0},{"_id":"63699423844f8efad0e6ee48","name":"Bill Gates","gender":"Male","email":"Billgates@Microsoft.com","category":"CEO","url":"http://res.cloudinary.com/ddms76vie/image/upload/v1667863588/ujpdpbuk5lwudnjbuvtq.jpg","about":"The four students formed the Lakeside Programmers Club to make money.[25] At the end of the ban, they offered to find bugs in CCC's software in exchange for extra computer time. Rather than using the system remotely via Teletype, Gates went to CCC's offices and studied source code for various programs that ran on the system, including Fortran, Lisp, and machine language. The arrangement with CCC continued until 1970 when the company went out of business.\r\n\r\nThe following year, a Lakeside teacher enlisted Gates and Evans to automate the school's class-scheduling system, providing them computer time and royalties in return. The duo worked diligently in order to have the program ready for their senior year. Towards the end of their junior year, Evans was killed in a mountain climbing accident, which Gates has described as one of the saddest days of his life. Gates then turned to Allen who helped him finish the system for Lakeside\r\n\r\n","__v":0},{"_id":"63699491844f8efad0e6ee4b","name":"Mark Zukerbarg","gender":"Male","email":"Mark@Meta.com","category":"CEO","url":"http://res.cloudinary.com/ddms76vie/image/upload/v1667863698/yxmo3wl5kbyjjhoftnuj.webp","about":"Zuckerberg began using computers and writing software in middle school. In high school, he built a program that allowed all the computers between his house and his father's dental office to communicate with each other.[17][18] During Zuckerberg's high-school years, he worked to build a music player called the Synapse Media Player. The device used machine learning to learn the user's listening habits, which was posted to Slashdot[19] and received a rating of 3 out of 5 from PC Magazine.[20] A New Yorker profile said of Zuckerberg: \"some kids played computer games. Mark created them.\"","__v":0},{"_id":"636994d8844f8efad0e6ee4e","name":"Sunder Pichai","gender":"Male","email":"Sunder@Google.com","category":"CEO","url":"http://res.cloudinary.com/ddms76vie/image/upload/v1667863769/yxl9b5chg0ytt6sgt48i.jpg","about":"Pichai worked in engineering and product management at Applied Materials and in management consulting at McKinsey & Company.[25] Pichai joined Google in 2004, where he led the product management and innovation efforts for a suite of Google's client software products, including Google Chrome[26] and ChromeOS, as well as being largely responsible for Google Drive. He went on to oversee the development of other applications such as Gmail and Google Maps.[27][28] On November 19, 2009, Pichai gave a demonstration of ChromeOS; the Chromebook was released for trial and testing in 2011, and released to the public in 2012.[29] On May 20, 2010, he announced the open-sourcing of the new video codec VP8 by Google and introduced the new video format, WebM.","__v":0},{"_id":"63699529844f8efad0e6ee51","name":"Elon Musk","gender":"Male","email":"Elon@Tesla.com","category":"CEO","url":"http://res.cloudinary.com/ddms76vie/image/upload/v1667863850/ja1rkgawnltkuuidddrd.jpg","about":"Elon Reeve Musk was born on June 28, 1971, in Pretoria, one of the capital cities of South Africa,[7][8] and was baptized into the Anglican church.[9] Musk has British and Pennsylvania Dutch ancestry.[10][11] His mother is Maye Musk (née Haldeman), a model and dietitian born in Saskatchewan, Canada, and raised in South Africa.[12][13][14] His father, Errol Musk, is a South African electromechanical engineer, pilot, sailor, consultant, and property developer, who was a half-owner of a Zambian emerald mine near Lake Tanganyika.[15][16] Musk has a younger brother, Kimbal, (born 1972) and a younger sister, Tosca, (born 1974).[14][17]\r\n\r\nMusk's family was wealthy during his youth.[16] His father was elected to the Pretoria City Council as a representative of the anti-apartheid Progressive Party, with his children sharing their father's dislike of apartheid.[7] His maternal grandfather, Joshua Haldeman, was an adventurous American-born Canadian who took his family on record-breaking journeys to Africa and Australia in a single-engine Bellanca airplane.[18][19][20] After his parents divorced in 1980, Musk mostly lived with his father.[10] Musk later regretted his decision because he has become estranged from his father.[21] He has a paternal half-sister and a half-brother.[18][22]\r\n\r\nIn his biography of Musk, Ashlee Vance described Musk as an awkward and introverted child.[23] When Musk was age ten, he developed an interest in computing and video games, teaching himself how to program from his Commodore VIC-20 user manual.[24] At age twelve, he sold his BASIC-based game Blastar to PC and Office Technology magazine for approximately $500","__v":0},{"_id":"636998bb844f8efad0e6ee64","name":"Ratan Tata","gender":"Male","email":"Ratan@tcs.com","category":"CEO","url":"http://res.cloudinary.com/ddms76vie/image/upload/v1667864764/fva0pefgcrec0kjmo6ad.jpg","about":"Ratan Tata was born in Bombay, now Mumbai, during the British Raj, on 28 December 1937,[6] and is the son of Naval Tata (born in Surat). His biological maternal grandmother had been the sister of Hirabai Tata, wife of group founder Jamsetji Tata. His biological grandfather, Hormusji Tata, had belonged to the broader Tata family; Ratan therefore was a Tata by birth. Parents Naval and Sonoo separated in 1948 when Ratan was 10, and he was subsequently raised by the widow of Sir Ratanji Tata, his grandmother, Navajbai Tata, who formally adopted him through the J. N. Petit Parsi Orphanage.[7] He has a half-brother, Noel Tata (from Naval Tata's second marriage with Simone Tata), with whom he was raised. His first language is Gujarati.","__v":0},{"_id":"63699978844f8efad0e6ee6b","name":"Yash Soni","gender":"Male","email":"yashsoni48678@gmail.com","category":"Employ","url":"http://res.cloudinary.com/ddms76vie/image/upload/v1667864953/rbweb497lfkj0j7vwtdb.jpg","about":"I am currently doing My BCA from SilverOak University.I have much curious about To learn new technology and build something which are fix some problem,so that I trying to shape my career in IT industry.\r\n\r\n          All tech fields are super attactive but in some of them especially my favourites are Competative Coding,Machine Learning,Data Science and ios Development.\r\n\r\n          With this The Curiousity can't calm me down, I always make new sketches and spend a few of my hours when I want to reconnect.Some sketches i have added to this website, on Sketches Section so you must be check it out.\r\n\r\n          So it's all About me if you have any question or suggestion to ask me via drop massage in Contact form or E-mail.","__v":0},{"_id":"63699a1e844f8efad0e6ee6f","name":"Mukesh Khanna","gender":"Male","email":"Mukeshkhanna@ParleG.com","category":"CEO","url":"http://res.cloudinary.com/ddms76vie/image/upload/v1667865118/vtcftc0cp9owtdsyulec.png","about":"Mukesh Khanna is an Indian actor, talk show host and producer who works in Hindi language films and television shows. He is best known for his portrayal of Shaktimaan, the superhero character in Shaktimaan (1997–2005) and Bhishma in Mahabharat (1988–1990), and also for his appearances in Pyaar Ka Dard Hai Meetha Meetha Pyaara Pyaara (2012–2013).\r\n\r\nKhanna was also the chairman of Children's Film Society India, from which he resigned in February 2018.[3] He is also the founder and director of entertainment company Bheeshm International.[4] He is currently running The Mukesh Khanna Show on his own YouTube channel named Bheeshm International ","__v":0},{"_id":"636a2c069a215e9adc68fa9f","name":"Sanket Singh","gender":"Male","email":"Sanket@google.employ","category":"Employ","url":"http://res.cloudinary.com/ddms76vie/image/upload/v1667902471/cmo39cfjymhunsyyj0cq.jpg","about":"I am Sanket Singh, working as a Software Engineer @ Google. I am an Ex - Software Engineer @ LinkedIn and Ex - Software Engineer @ Interviewbit. I am a former Google Summer Of Code Student Developer under Berkman Klein Centre @ Harvard University. \r\nMy expertise and field of interest lie in Tech, Engineering, Software Development, Coding, etc. I will be posting things around tech and my travel vlogs on this channel","__v":0},{"_id":"636a2c519a215e9adc68faa3","name":"Nishant Chahar ","gender":"Male","email":"Nishant@microsoft.employ","category":"Employ","url":"http://res.cloudinary.com/ddms76vie/image/upload/v1667902544/gr1intklohguori0wyaj.jpg","about":"I am a Software Engineer at Microsoft, graduated from NSIT in 2021.\r\nI have interned at Samsung Research Institue Banglore as a software developer intern and I have also Won Smart India Hackathon. I love to try different things.","__v":0},{"_id":"636a2cb49a215e9adc68faa7","name":"Ayushi Sharma","gender":"female","email":"Ayushi@walmart.employ","category":"Employ","url":"http://res.cloudinary.com/ddms76vie/image/upload/v1667902644/qtqysd2vkifkij1rxbdy.jpg","about":"\r\nI am working as Software Engineer 2 at Walmart Global Tech India. \r\nA channel to make people fall in love with Data structures and Algorithms. I have started solving Love Babbar DSA Cracker sheet and solve Leetcode daily challenges.  Feel free to connect with me on the below ID's for any queries and suggestions.","__v":0},{"_id":"636a2d669a215e9adc68faa9","name":"Anshika Gupta","gender":"female","email":"anshikagpt97@gmail.com","category":"Employ","url":"http://res.cloudinary.com/ddms76vie/image/upload/v1667902820/v49tgj2qymynk5cj0wfc.jpg","about":"Hi, I âm Anshika, a Software Engineer by profession and a Social Media Marketer from the heart.\r\nI started my Software Engineering journey 1 year ago when I joined Amazon. And the journey till now has been really awesome.\r\nOh, did I say I'm also a State-level Athletic player with 100m Race & Shot Put as my favorite sport?\r\nI started Youtube Channel to help the student community by sharing my knowledge regarding Job Preparation, Personal growth & other aspects of College Life.\r\nSocial Media is much more than numbers, and I really love playing with algorithms, creating value-adding content & designing proper platform & niche-based strategies.\r\nHow can I help you?\r\nFor College Students You can follow me on LinkedIn or other Social Media Platforms for diversified content aiming at increasing knowledge & awareness.\r\nCan be fun sometimes, If I am able to crack good joke through my storytelling :P\r\nBrands/ Influencers, I can help you create awesome content and grow organically through marketing strategy and planning over social media.\r\nDrop a text or feel free to connect at anshikagpt97@gmail.com.\r\nWould be happy to respond!\r\n","__v":0},{"_id":"636a2e3e9a215e9adc68fab2","name":"Anuj Kumar Sharma  ","gender":"Male","email":"Anuj@amazon.employ","category":"Employ","url":"http://res.cloudinary.com/ddms76vie/image/upload/v1667903039/eofvfhhi8rg6ajovdazv.jpg","about":"What's up guys, Anuj here. Ex Software Engineer at Amazon & Urban Company and a self-taught programmer. I started this channel to teach you all the things I have learned, things I wish I had known sooner, and things to help you along the way. I'll teach you how to learn new Programming languages, help you understand Data Structures and Algorithms, and develop your soft skills. My goal is to provide you the best advice I can through tutorials so that you can crack the dream company you deserve.","__v":0},{"_id":"636a2e849a215e9adc68fab4","name":"AMAN DHATTARWAL  ","gender":"Male","email":"AMAN@apnikaksha.ceo","category":"CEO","url":"http://res.cloudinary.com/ddms76vie/image/upload/v1667903109/zubwsdlgjjejixdyspdx.jpg","about":"\r\nTeacher by Choice and Entrepreneur by Chance.\r\n\r\nLast 7 years have given us love from 8 Million+ students on our YouTube Channels. Any student can watch & learn from our lectures. Have got the opportunity to be a Guest Speaker in 99 of India's Top Colleges/Universities like IIT Delhi, IIT Bombay, DU, BITS Pilani, Jadavpur and many more.\r\n\r\nApna College is now India's fastest growing channel for College students who love coding.\r\nWe love to teach and help students across India find their right career path.\r\n\r\nIn the next few decades, India will rise as the leader of the world with the maximum young workforce, but for this, we need some good pilots who can take us through this.\r\nI help these young hustlers find their true potential so that they can fly India to victory.\r\n\r\nAlong with this love for animals & learning is constant.","__v":0},{"_id":"636b87838a1b532130c2f268","name":"Gaytri soni","gender":"female","email":"gaytris89@gmail.com","category":"CEO","url":"http://res.cloudinary.com/ddms76vie/image/upload/v1667991427/liezefurkzo35z0s7p7r.jpg","about":"I am gaytri vijay kumar soni .Currently i am CEO of my own business which is Samarpan tailoring and boutique work .Providing my service as much as people with this vison i expending and running my business if you wanna contact me just dial   98######81 . ","__v":0},{"_id":"636db4d77d38b2220d4d9b0e","name":"yash","gender":"Male","email":"yashsoni48678@gmail.com","category":"Employ","url":"http://res.cloudinary.com/ddms76vie/image/upload/v1668134103/vfhszhcr5e5fti8egyht.jpg","about":"all_profile","__v":0},{"_id":"636dffe805db89b517966813","name":"Deep Shah","gender":"Male","email":"Deep@shah.com","category":"CEO","url":"http://res.cloudinary.com/ddms76vie/image/upload/v1668153319/ebev3yobsshougmcjiau.png","about":"This is deep","__v":0},{"_id":"6371179d7ee70e866ec84de0","name":"Manav Patel","gender":"Male","email":"manav.permanet@gmail.com","category":"Employ","url":"http://res.cloudinary.com/ddms76vie/image/upload/v1668355997/yrq4nlrcpl0r711ohz6w.jpg","about":"Hey there, I am a full stack developer testing this website.","__v":0}]},"__N_SSG":true}