{"pageProps":{"data":[{"_id":"638094a9d82caf87b72114ed","subject":"How to Implement gRPC services in NodeJS?","short_description":"gRPC: Google Remote Procedure Call is a Google-developed open-source framework. The gRPC lets you define REQUEST AND RESPONSE for Remote Procedure Call and lessens your struggle by handling the rest.We all know how popular and successful NodeJs is. So, in this tutorial, we will implement gRPC services in NodeJs. We will build a demo application and perform a CRUD operation. So without further ado let’s get started with the implementation of gRPC services in our NodeJS application.  ","short_description_para_1":"First of all, we have imported @grpc/grpc-js and @grpc/proto-loader libraries. The const variable named PROTO PATH will save the location of students.proto file. Later, loadSync method will load the proto file into gRPC. And loadPackageDefinition method will load the package definition. After that, to initialize the server instance () we will call new grpc.server Create Client stub We will call the getAll method defined in Server’s addService method as the second parameter from the client, as shown below.For inserting data create a new method. Open the proto file and under services, you can add an RPC with the name of the new method. Here, the name of our method is Insert under StudentService service as shown below.","short_description_para_2":"We now have a server, proto, and client all built and ready. Attach a Node server to the client.js so an endpoint in our server will call the procedure in the gRPC news service. Here are the endpoints./GET endpoint will call the getAll sub-routine to get all the students in the database./save POST endpoint will call the insert sub-routine to create a new student item./update PUT will call the update sub-routine to edit/update a student item./remove DELETE will call the delete sub-routine to delete a student item.Here’s the code in Nodejs:","short_description_para_3":"So, this was about how can we implement gRPC services in NodeJS. I hope your purpose of landing on this tutorial has served you well. If you are a NodeJS enthusiast then feel free to visit the NodeJS tutorials page and learn more about Node. We are always open to suggestions and feedback. Write us back if you have any questions. Bacancy has best NodeJS developers with basic and advanced knowledge; contact us to hire NodeJs developers for your application.","short_description_para_4":"WeIt is necessary to measure and monitor the Node Js performance of your existing Node application to have a better overall performance idea.Once you are aware of the performance of your application, you can easily optimize your web application to get maximum performance. Below are the few key points product owners can consider in making their web applications highly scalable.","__v":0}]},"__N_SSG":true}