{"pageProps":{"data":[{"_id":"63809326d82caf87b72114eb","subject":"How to Build a Blog Using a Static Site Generator and a CDN","short_description":"In short, an SSG is a framework designed to manage your website and transform it into a site serving only static pages.One thing that took me some time to comprehend was why I would use a static site, if I already had a CMS. There were so many articles online about using an SSG with a headless CMS...but why? ","short_description_para_1":"Best I can tell, the benefits are simply that you have more flexibility using familiar frameworks such as React or Vue, while using a CMS to handle all content.However, as I am by no means a frontend developer, I was close to scrapping this project. I thought Oh well, I should just use Ghost - it's only $5/month if hosted on a platform like DigitalOcean, and is an all-in-one platform to serve content as well as manage the content.However, I really wanted to try to learn something new, and see if I could just deploy a blog for free using only Markdown.As always ends up happening, what I was hoping would take a few hours took quite a bit more time as I went down the rabbit hole of research into various technologies.I played around with several different technologies, such as (not all of these are SSGs, more on that later","short_description_para_2":"Other potentially useful front matter elements are:description - This allows you to enter a description for the content.expiryDate - Set a datetime for when the content should no longer be published.keywords - The meta keywords for the content.lastmod - The datetime for when the content was last modified (if you are using the enableGitInfo configuration command, this will be automatically set as the last time the file was mofieid in Git)markup - When set to rst, you can use reStructuredText instead of Markdown (this feature is experimental)publishDate - Set a date in the future for the content to be displayed.slug - The tail of the output URL. Defaults to the filename if not specified.summary - The text used when providing a summary of the article. I find this useful if I don't want the first paragraph to appear in the summary, which is the typical default.<taxonomies> - Use the plural form of the taxonomy index, such as tags or categories ","short_description_para_3":"Now that we have our site stored in Git, it's time to deploy! Almost done - I'll now show how to deploy to Netlify in under 10 minutes.First, we need to create the Netlify application (feel free to create an account using any method available):You should now see your domain with a message saying to Check DNS configuration. Click on that, and enter the provided DNS record information into whichever service provider manages your DNS records:","short_description_para_4":"We have one final step before we are truly ready to use Netlify. Unfortunately, the version of Hugo used by Netlify is somewhat outdated by default. However, we can fix this by creating our own configuration for Netlify to follow when deploying our site.First, create a file called netlify.toml in the root of your repository, and then add the following configuration:If I were to incorporate a lot of media, such as images or videos that I need to upload, it would certainly get tedious adding and organizing them all to the images folder in static.At that point, I would look into a headless CMS such as Ghost, Netlify, or Sanity to manage the content, as long as I could still write my posts using Markdown.","__v":0}]},"__N_SSG":true}